[
    {
        "text": "I’ve seen people cry after a rejection.\nNot because they didn’t get the job…\nBut because the process broke them.\n\n– Ghosted after 6 rounds.\n– No feedback after weeks of effort.\n– False promises about salary, role, and growth.\n\nEvery job seeker deserves dignity.\nBecause behind every application is a story:\n– A fresh graduate supporting their family.\n– A laid-off employee trying to rebuild.\n– A parent who just wants stability for their kids.\n\nA simple ‘Thank you, we appreciate your time’ can bring hope.\nA little empathy can bring healing.\n\nHR is not just about filling roles.\nIt’s about shaping lives.\nPlease don’t forget the human in human resources.",
        "engagement": 345,
        "line_count": 13,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "HR"
        ]
    },
    {
        "text": "You didn’t get rejected because you’re not good enough.\nYou didn’t get ghosted because your skills are weak.\nYou didn’t get that “We’ll get back to you” mail because you lacked effort.\n\nThe truth is:\n* Many job postings already have someone in mind.\n* Many interviews are just for compliance.\n* Many “recruitment processes” are designed to exploit hope, not talent.\n\nBut here’s what they can’t take away from you:\n✔ Your skills that you’ve built brick by brick.\n✔ Your resilience that kept you going despite rejections.\n✔ Your fire to grow, even when the world is unfair.\n\nTo every job seeker reading this:\nYou are not your rejection mail.\nYou are not “we found someone else.”\nYou are proof that courage exists in human form.\n\nOne “yes” is all it takes.\nAnd it’s coming your way. 💙\n\nIf you’re looking, comment “open to work” – let’s create visibility (along with the role that you're looking for)\n\nIf you’re hiring, please drop opportunities below – you might just change someone’s life today.",
        "engagement": 0,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "Resilience"
        ]
    },
    {
        "text": "A recent survey found that 68% of job seekers applied to roles that were never actively hiring.\nAnother report revealed that over 40% of job postings online are “ghost jobs.”\n\nWhy do companies do this?\n\nTo look like they are growing (good for investors).\nTo build a candidate pipeline they’ll never call.\nTo make employees think “we are hiring, so business is great.”\nSometimes just to collect free resumes for future reference.\n\nBut the impact?\n\n70% of candidates report feeling “demotivated” when they realize the job was never real.\nPeople waste hours applying, editing resumes, and preparing for nothing.\nIt worsens the already fragile mental health of job seekers.\n\nGhost hiring isn’t just unethical - it’s cruel.\nWhen hope is given without intention, it becomes exploitation.\n\nIf you’ve ever refreshed your inbox waiting for a reply that never comes - you’re not alone.\n\nAnd if you’re a company doing this? Remember: reputation is harder to rebuild than a candidate pipeline.\n\nJob seekers deserve honesty. Not illusions.",
        "engagement": 0,
        "line_count": 17,
        "language": "Hinglish",
        "tags": [
            "Scams",
            "Job Search"
        ]
    },
    {
        "text": "Respect.\nA word we all use, but don’t always mean the same way.\n\nFor some, respect means treating someone like a human being.\nFor others, respect means treating someone like an authority.\n\nThe real issue?\nWhen people in power say:\n“ If you don’t respect me, I won’t respect you.”\n\nBut what they actually mean is:\n“ If you don’t treat me like an authority, I won’t treat you like a person.”\n\nAnd that’s dangerous.\nBecause everyone deserves to be treated like a person - no matter their title, position, or power.\n\nRespect should never be conditional on hierarchy.\nIt should be the bare minimum of humanity.",
        "engagement": 0,
        "line_count": 9,
        "language": "Hinglish",
        "tags": [
            "Respect"
        ]
    },
    {
        "text": "LinkedIn reach these days be like:\n\nYou post your heart, your soul, and a sprinkle of your sanity...\n…and LinkedIn shows it to exactly 3 people.\n\nOne of them is your mom.\n\nThe other is you (because you went back to check the likes).\n\nAnd the last is that one guy from your last job who never liked you but still stalks you.\n\nMoral of the story:\nAt this point, I think I’m writing a personal diary here.\n\nI commented “Congrats!” on someone else’s post - got more views than my own post.",
        "engagement": 0,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Social Media",
            "LinkedIn"
        ]
    }
]